In [1]:
import pandas as pd

#### Series

In [3]:
s = pd.Series([56,22,15,38,63,29,76])
s

0    56
1    22
2    15
3    38
4    63
5    29
6    76
dtype: int64

In [4]:
s = pd.Series([56,22,15,38,63.35,29,76])
s

0    56.00
1    22.00
2    15.00
3    38.00
4    63.35
5    29.00
6    76.00
dtype: float64

In [5]:
s.dtype

dtype('float64')

In [6]:
s.size

7

In [7]:
s[3]

38.0

In [8]:
type(s)

pandas.core.series.Series

In [9]:
s[3] = 304
s

0     56.00
1     22.00
2     15.00
3    304.00
4     63.35
5     29.00
6     76.00
dtype: float64

In [10]:
s = pd.Series([56,22,15,38,63,29,76],
              index=range(100,107))

In [11]:
s

100    56
101    22
102    15
103    38
104    63
105    29
106    76
dtype: int64

In [12]:
s[103]

38

#### DataFrame

In [15]:
x = pd.Series([1,2,3,4,5])
y = pd.Series(['Ajay','Ram','Priya','Sunita',
               'Vijay'])
z = pd.Series([56.34,86.17,75.67,47.86,63.40])

In [17]:
df = pd.DataFrame({
    'roll':x,
    'name':y,
    'marks':z
})

In [18]:
df

   roll    name  marks
0     1    Ajay  56.34
1     2     Ram  86.17
2     3   Priya  75.67
3     4  Sunita  47.86
4     5   Vijay  63.40

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [21]:
df.shape

(5, 3)

#### Data Analysis operations

In [24]:
# Location: https://mitu.co.in/dataset
# Download all files start with name 'student'
# Save these files in home
# student.csv, student1.csv .....

#### Load the data

In [26]:
df = pd.read_csv('student.csv')

In [27]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [28]:
type(df)

pandas.core.frame.DataFrame

In [29]:
df.shape

(10, 5)

In [30]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [31]:
df.size

50

In [32]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [33]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [34]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [35]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [36]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

#### Slicing the data

In [39]:
x = df.iloc[2:8,1:4]
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [40]:
df.iloc[:8,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [41]:
df.iloc[4:,1:4]

     name class  marks
4    asha    TE  63.28
5  ayesha    BE  49.55
6    amar    BE  65.34
7   amita    BE  68.33
8    amol    TE  56.75
9   anmol    BE  78.66

In [42]:
df.iloc[4:,1:]

     name class  marks  age
4    asha    TE  63.28   20
5  ayesha    BE  49.55   20
6    amar    BE  65.34   19
7   amita    BE  68.33   23
8    amol    TE  56.75   20
9   anmol    BE  78.66   21

In [43]:
df.iloc[:,:]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [44]:
df.iloc[[5,9,2,4],:]

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
9    10   anmol    BE  78.66   21
2     3  aniket    BE  76.88   19
4     5    asha    TE  63.28   20

In [45]:
df.iloc[:,[1,3]]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [46]:
df.iloc[[5,9,2,4],[1,3]]

     name  marks
5  ayesha  49.55
9   anmol  78.66
2  aniket  76.88
4    asha  63.28

In [47]:
df.iloc[4,:]

roll         5
name      asha
class       TE
marks    63.28
age         20
Name: 4, dtype: object

In [48]:
df.iloc[:,3]

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [49]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [50]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [51]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [52]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [53]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [54]:
df.drop([5,8,2])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [55]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [56]:
df.drop(['class','age'], axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

#### Functions or methods

In [58]:
df['marks'].mean()

64.499

In [59]:
df['marks'].min()

49.55

In [60]:
df['marks'].max()

78.66

In [61]:
df['marks'].median()

64.31

In [62]:
df['marks'].sum()

644.9899999999999